cask_args appdir: '/Applications'

tap 'aws/tap'
tap 'azure/functions'
tap 'grammarly/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'p7zip'
brew 'ack'
brew 'bat'
brew 'c-ares'
brew 'coreutils'
brew 'exercism'
brew 'gcc' # GNU compiler collection
brew 'go'
brew 'golangci-lint' # Fast linters runner for Go
brew 'gh'
brew 'gradle'
brew 'grc' # Colorize logfiles and command output
brew 'ffmpeg'
brew 'elm'
brew 'icu4c'
brew 'jq' # command-line JSON processor
brew 'maven'
brew 'minikube' # Run a Kubernetes cluster locally
brew 'mongosh'
brew 'nvm'
brew 'openjdk'
brew 'pyenv'
brew 'roundup' # unit testing shell
brew 'tldr' # Simplified man pages
brew 'tree'
brew 'sqlite'
brew 'wget'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting'

cask 'alfred'
cask 'deckset' # presentation 
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'fork'
cask 'firefox'
cask 'intellij-idea'
cask 'iterm2'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'grammarly'
cask 'handbrake' # video transcoder 
cask 'keycastr' # keystroke visualizer
cask 'kindle'
cask 'mark-text'
cask 'nordvpn'
cask 'nordpass'
cask 'obsidian' # obsidian.md
cask 'omnidisksweeper' # Finds large, unwanted files and deletes them
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'rectangle' # Move/resize windows w/ shortcuts 
cask 'tor'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'
cask 'zoom'
